/*
  Самые базовые конфиги.
  Скетч писался под конкретные виды гирлянд.
  Гирлянда в зале (HALL_LEDS) представляет собой 8 веток, соединённых последовательно. Общее количество светодиодов 100, количество по ветвям: {11, 12, 13, 14, 14, 13, 12, 11}
  Гирлянда в детской (не определено HALL_LEDS и TV_LEDS) - 9 веток, соединённых последовательно. Общее количество светодиодов 74, количество по ветвям: {8, 7, 9, 8, 10, 8, 9, 7, 8}
  Гирдянда под телевизором. (!HALL_LEDS && TV_LEDS) - 88 светодиодов, разделены на 2 группы по 44, соединены последовательно.
  Отдельная прошивка под мастер-гирлянду, висящую на ёлке. В CristmasTree_ESP. Количество светодиодов 126. Можно поменять в конфиге.
*/

//#define HALL_LEDS //оконная гирлянда в зале? Если не определено - то в детской

#ifndef HALL_LEDS
  #define TV_LEDS //гирлянда под телевизором? Должно быть выключено HALL_LEDS
#endif

#ifndef TV_LEDS
  #define OTA_NAME "CristmasWindowESP%u"
#else
  #define OTA_NAME "TVLedsESP%u"
#endif

#define UDP_HALL_WINDOW   0x08
#define UDP_HALL_TV       0x09
#define UDP_CHILDREN      0x0A
